"""
Задача 1

Создайте несколько переменый разных типов.
Проверте к какому типу относяться созданные переменные.
"""
name = 'John'
print(type(name))

age = 30
print(type(age))

height = 1.85
print(type(height))

is_student = False
print(type(is_student))

hobbies = ['reading', 'swimming']
print(type(hobbies))

address = ('New York', 'USA')
print(type(address))

personal_info = {'name': 'John', 'age': 30, 'height': 1.85}
print(type(personal_info))
