'''
Задача 6
Напишите программу банкомат.

1. Начальная сумма равна нулю
2. Допустимые действия: пополнить,снять,выйти
3. Сумма пополнения и снятия кратны 50 условных единиц
4. Процент за снятие - 1,5% от суммы снятия, но не меньше 30 и не более 600 условных единиц
5. После каждой третьей операции пополнения или снятия начисляються проценты - 3%
6. Нельзя снять больше, чем на счёте
7. При привышении суммы в 5000000,вычитать налог на богатство 10% перед каждой операцией, даже ошибочной
8. Любое действие выводит сумму денег
'''

